In [1]:
import numpy as np
from pandas import DataFrame
from pandas import Series

In [2]:
people = {'name':['Jim','Rob','Tom'],'age':[22,44,55],'location':['US','UK','AUS']}
frame = DataFrame(people)
frame

  name  age location
0  Jim   22       US
1  Rob   44       UK
2  Tom   55      AUS

In [3]:
frame = DataFrame(people,columns=['name','location','age'])
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

In [4]:
frame = DataFrame(people,columns=['name','location','age','salary'])
frame

  name location  age salary
0  Jim       US   22    NaN
1  Rob       UK   44    NaN
2  Tom      AUS   55    NaN

In [5]:
frame['location']

0     US
1     UK
2    AUS
Name: location, dtype: object

In [6]:
frame.location

0     US
1     UK
2    AUS
Name: location, dtype: object

In [7]:
frame.loc[1]

name        Rob
location     UK
age          44
salary      NaN
Name: 1, dtype: object

In [8]:
frame.salary = 5000
frame

  name location  age  salary
0  Jim       US   22    5000
1  Rob       UK   44    5000
2  Tom      AUS   55    5000

In [9]:
salaries = Series([1000,2000,3000])
frame.salary = salaries
frame

  name location  age  salary
0  Jim       US   22    1000
1  Rob       UK   44    2000
2  Tom      AUS   55    3000

In [10]:
del frame['salary']
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

**Reindexing**

In [11]:
s = Series([10,20,30,40,50],index=['c','a','d','b','e'])
s

c    10
a    20
d    30
b    40
e    50
dtype: int64

In [13]:
s = s.reindex(['a','b','c','d','e'])
s

a    20
b    40
c    10
d    30
e    50
dtype: int64

In [14]:
d = DataFrame(np.arange(9).reshape((3,3)),index=['c','a','b'],columns=['apple','mango','banana'])
d

   apple  mango  banana
c      0      1       2
a      3      4       5
b      6      7       8

In [18]:
d = d.reindex(['a','b','c'])
d

   apple  mango  banana
a      3      4       5
b      6      7       8
c      0      1       2

In [19]:
d = d.reindex(columns=['mango','banana','apple'])
d

   mango  banana  apple
a      4       5      3
b      7       8      6
c      1       2      0

**Arithmetic with Fill Values**

In [21]:
s1 = Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2 = Series([1,2,3,4,5,6,7],index=['a','b','c','d','e','f','g'])

In [22]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [24]:
s1+s2

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
f     NaN
g     NaN
dtype: float64

In [26]:
#add method
s1.add(s2,fill_value=0)

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
f     6.0
g     7.0
dtype: float64

In [27]:
d1 = DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'])
d2 = DataFrame(np.arange(16).reshape(4,4),columns=['a','b','c','d'])

In [28]:
d1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [29]:
d2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [30]:
d1 + d2

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3   NaN   NaN   NaN   NaN

In [31]:
#add method
d1.add(d2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3  12.0  13.0  14.0  15.0

**Adding Series and Dataframe**

In [32]:
s = Series([1,2,3,4])
d = DataFrame(np.arange(8).reshape(2,4))

In [33]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [34]:
d

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [35]:
d+s

   0  1  2   3
0  1  3  5   7
1  5  7  9  11